# nested_test_1.sh
n=6
steps=0

while (( n > 1 )); do
    (( rem = n % 2 ))
    
    if (( rem == 0 )); then
        (( n = n / 2 ))
    else
        (( n = 3 * n + 1 ))
    fi
    
    (( steps = steps + 1 ))
done

echo $steps
echo $n

# Выражение: Алгоритм Коллатца для n = 6.
# Шаги (n меняется так):
# 1) 6 четное -> n = 3
# 2) 3 нечетное -> n = 3*3+1 = 10
# 3) 10 четное -> n = 5
# 4) 5 нечетное -> n = 3*5+1 = 16
# 5) 16 четное -> n = 8
# 6) 8 четное -> n = 4
# 7) 4 четное -> n = 2
# 8) 2 четное -> n = 1 -> Выход из цикла.

# ОТВЕТ: steps = 8 (n = 1)