# nested_test_3.sh

x=3
y=5
z=2
res=0

# Осторожно: очень глубокая вложенность операций!
(( res = ( ((x + 1) * (y + 1)) - ((z - 1) * (x + 2)) ) * ( ((y + 2) * (z - 2)) + ((x * y) / 2) ) ))

echo $res

# Выражение и шаги вычисления:
# Левая большая скобка:
# 1) x+1 = 4; y+1 = 6  -> 4 * 6 = 24
# 2) z-1 = 1; x+2 = 5  -> 1 * 5 = 5
# 3) 24 - 5 = 19
# Правая большая скобка:
# 4) y+2 = 7; z-2 = 0  -> 7 * 0 = 0
# 5) x*y = 15 -> 15 / 2 = 7 (целочисленное деление!)
# 6) 0 + 7 = 7
# Финал:
# 7) 19 * 7 = 133

# ОТВЕТ: res = 133